{
  "HomePage": {
    "title": "Hello world!",
    "about": "Go to the about page"
  },
  "NavbarLogin": {
    "backtohome": "ย้อนกลับสู่หน้าหลัก",
    "backtologin": "ย้อนกลับสู่เข้าสู่ระบบ"
  },
  "Login": {
    "Login": "เข้าสู่ระบบ",
    "Sign up": "สมัครสมาชิก",
    "Email": "อีเมล์",
    "Password": "รหัสผ่าน",
    "Forgot": "ลืมรหัสผ่าน?",
    "Condition1": "ใช่, ฉันยินยอมใน ",
    "Condition2": "เงื่อนไขและข้อกำหนดทั้งหมด",
    "btntext": "LOGIN",
    "btnpending": "LOGIN"
  }, 
  "Signup": {
    "Login": "เข้าสู่ระบบ",
    "Signup": "สมัครสมาชิก",
    "Email": "อีเมล์",
    "Address": "ที่อยู่",
    "AddressDetail": "(บ้านเลขที่ หมู่บ้าน หรือ คอนโด ถนน ซอย)",
    "Addressplaceholder": "ที่อยู่ของคุณ",
    "Password": "รหัสผ่าน",
    "PasswordDetail": "(Your password)",
    "Passwordplaceholder": "password",
    "PasswordCondition": "รหัสผ่านต้องมีอย่างน้อย 8 ตัวอักษร และประกอบด้วย ตัวพิมพ์ใหญ่(A-Z) ตัวพิมพ์เล็ก(a-z) \nตัวเลข (0–9) และอักขระพิเศษ (.-!@#$%^&*)",
    "Province": "จังหวัด",
    "PasswordConfirm": "ยืนยันรหัสผ่าน",
    "PasswordConfirmplaceholder": "confirm password",
    "District": "อำเภอ",
    "Name": "ชื่อจริง",
    "SubDistrict": "ตำบล",
    "Surname": "นามสกุล",
    "PostalCode":"รหัสไปรษณีย์",
    "Datebirth":"วันเกิด",
    "Telephone":"เบอร์โทร",
    "Favorite":"วงเกาหลีหรือศิลปินที่ชอบ",
    "Condition1": "ใช่, ฉันยินยอมการสมัครและยอมรับ",
    "Condition2": "เงื่อนไขทั้งหมด",
    "btntext": "LOGIN",
    "btnpending": "LOGIN"
},  "termsAndConditionsPage": {
  "title": "เงื่อนไขและข้อกำหนดในการเข้าสู่ระบบ",
  "subtitle": "การเข้าสู่ระบบของเราถือว่าคุณยอมรับเงื่อนไขและข้อกำหนดดังต่อไปนี้",
  "sections": [
    {
      "heading": "เงื่อนไขการเข้าสู่ระบบ",
      "items": [
        "การตรวจสอบสิทธิ์: ผู้ใช้ต้องให้ข้อมูลที่ถูกต้องและเป็นความจริง ห้ามมิให้ใช้ข้อมูลประจำตัวของผู้อื่นโดยไม่ได้รับอนุญาตโดยเด็ดขาด",
        "ความรับผิดชอบ: ผู้ใช้มีหน้าที่รับผิดชอบต่อกิจกรรมทั้งหมดภายใต้บัญชีของตน และต้องเก็บรักษาข้อมูลเข้าสู่ระบบเป็นความลับ",
        "การรวบรวมและใช้ข้อมูล: โดยการเข้าสู่ระบบ คุณยินยอมให้เราเก็บรวบรวมและใช้ข้อมูลส่วนบุคคลของคุณตามที่ระบุไว้ใน [นโยบายความเป็นส่วนตัว] ของเรา",
        "การคุ้มครองข้อมูล: เราจะปกป้องข้อมูลของคุณตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562 (PDPA) และกฎหมายอื่นๆ ที่เกี่ยวข้อง",
        "การระงับหรือยกเลิกบัญชี: หากตรวจพบการละเมิดเงื่อนไขเหล่านี้ ผู้ให้บริการมีสิทธิ์ในการระงับหรือยกเลิกบัญชีโดยไม่ต้องแจ้งให้ทราบล่วงหน้า"
      ]
    },
    {
      "heading": "เงื่อนไขการสั่งซื้อ (สินค้าพร้อมส่ง และ พรีออเดอร์)",
      "subsections": [
        {
          "heading": "สินค้าพร้อมส่ง (In-stock Items)",
          "subsections": [
            {
              "heading": "1) ระยะเวลาจัดส่ง",
              "items": [
                "• ออเดอร์จะถูกจัดส่งภายใน 1-3 วันทำการ หลังจากยืนยันการชำระเงิน",
                "• เลขติดตามจะถูกส่งให้ในวันจัดส่ง"
              ]
            },
            {
              "heading": "2) การชำระเงิน",
              "items": [
                "• ต้องชำระเงินเต็มจำนวนก่อนจัดส่ง",
                "• ไม่รองรับการเก็บเงินปลายทาง (COD)"
              ]
            },
            {
              "heading": "3) การคืนและเปลี่ยนสินค้า",
              "items": [
                "• รับคืนเฉพาะในกรณีที่สินค้ามีตำหนิหรือผิดจากคำสั่งซื้อ",
                "• ลูกค้าต้องแจ้งให้เราทราบภายใน 2 วันหลังจากได้รับสินค้า"
              ]
            }
          ]
        },
        {
          "heading": "สินค้าพรีออเดอร์ (Pre-order Items)",
          "subsections": [
            {
              "heading": "1) รายละเอียดสินค้าและระยะเวลาจัดส่ง",
              "items": [
                "• สินค้านำเข้าจากเกาหลี ไม่ได้มีในสต็อกในประเทศ",
                "• ระยะเวลาจัดส่งโดยประมาณ: 15-30 วันทำการ (ไม่นับวันหยุด)"
              ]
            },
            {
              "heading": "2) ตัวเลือกการชำระเงิน",
              "items": [
                "ขึ้นอยู่กับสินค้า มีสองประเภทให้เลือก:",
                "• ชำระเงินเต็มจำนวน: ชำระ 100% ล่วงหน้า",
                "• ชำระค่ามัดจำ: ต้องวางเงินมัดจำ 50% เมื่อสั่งซื้อ",
                "• ยอดคงเหลือต้องชำระก่อนจัดส่งในประเทศ (เราจะแจ้งให้ทราบ)"
              ]
            },
            {
              "heading": "3) การยกเลิกคำสั่งซื้อและคืนเงิน",
              "items": [
                "• ไม่สามารถยกเลิกหรือคืนเงินคำสั่งซื้อที่วางไปแล้ว",
                "• จะคืนเงินเต็มจำนวน (รวมเงินมัดจำ) หากสินค้าไม่พร้อมจำหน่าย"
              ]
            },
            {
              "heading": "4) สินค้าหมดสต็อก",
              "items": [
                "หากสินค้าไม่มีจากซัพพลายเออร์อีกต่อไป ลูกค้าสามารถ:",
                "• ขอคืนเงินเต็มจำนวน หรือ",
                "• เปลี่ยนสินค้าเป็นผลิตภัณฑ์ที่มีมูลค่าใกล้เคียงกัน"
              ]
            },
            {
              "heading": "5) คุณภาพสินค้า",
              "items": [
                "• รอยตำหนิเล็กน้อยจากการผลิต (เช่น ด้ายหลุด หรือรอยพิมพ์) ถือว่ายอมรับได้และไม่สามารถคืนสินค้าได้"
              ]
            },
            {
              "heading": "6) ราคา",
              "items": [
                "• ราคาทั้งหมดรวมค่าจัดส่งระหว่างประเทศและภาษีนำเข้าแล้ว"
              ]
            }
          ]
        }
      ]
    },
    {
      "heading": "เงื่อนไขทั่วไป",
      "items": [
        "• กรุณาตรวจสอบชื่อและที่อยู่จัดส่งของคุณก่อนทำการชำระเงิน",
        "• ลูกค้ามีหน้าที่รับผิดชอบค่าจัดส่งซ้ำในกรณีที่ให้ข้อมูลผิดพลาด",
        "• เราจะไม่รับผิดชอบต่อความล่าช้าที่เกิดจากการผ่านพิธีการศุลกากรหรือบริษัทขนส่งบุคคลที่สาม"
      ]
    }
  ]
}
}